; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p27-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (OBJ p23)
    (OBJ p24)
    (OBJ p25)
    (OBJ p26)
    (at t0 l0-1)
    (at t1 l1-1)
    (at t2 l2-0)
    (at p0 l1-2)
    (at p1 l1-1)
    (at p2 l0-0)
    (at p3 l1-2)
    (at p4 l1-2)
    (at p5 l1-2)
    (at p6 l1-0)
    (at p7 l0-1)
    (at p8 l1-2)
    (at p9 l2-0)
    (at p10 l0-2)
    (at p11 l2-2)
    (at p12 l1-1)
    (at p13 l1-2)
    (at p14 l0-0)
    (at p15 l0-2)
    (at p16 l0-1)
    (at p17 l1-1)
    (at p18 l1-0)
    (at p19 l0-0)
    (at p20 l2-2)
    (at p21 l1-2)
    (at p22 l2-2)
    (at p23 l0-2)
    (at p24 l1-1)
    (at p25 l2-2)
    (at p26 l0-2)
    (at a0 l2-0)
)
(:goal
    (and
        (at p0 l2-1)
        (at p1 l1-0)
        (at p2 l0-2)
        (at p3 l0-2)
        (at p4 l2-1)
        (at p5 l0-1)
        (at p6 l2-0)
        (at p7 l0-0)
        (at p8 l0-2)
        (at p9 l0-2)
        (at p10 l2-0)
        (at p11 l2-1)
        (at p12 l0-0)
        (at p13 l2-2)
        (at p14 l0-0)
        (at p15 l2-2)
        (at p16 l1-0)
        (at p17 l0-2)
        (at p18 l0-1)
        (at p19 l1-1)
        (at p20 l0-0)
        (at p21 l2-0)
        (at p22 l1-2)
        (at p23 l1-2)
        (at p24 l0-2)
        (at p25 l2-0)
        (at p26 l0-1)
    )
)
)

; plan
1. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 1 of 27
2. (load-truck p25 t2 l2-2)
   deleted: (at p25 l2-2)
   added: (in p25 t2)
   goals met: 1 of 27
3. (load-truck p22 t2 l2-2)
   deleted: (at p22 l2-2)
   added: (in p22 t2)
   goals met: 1 of 27
4. (load-truck p20 t2 l2-2)
   deleted: (at p20 l2-2)
   added: (in p20 t2)
   goals met: 1 of 27
5. (load-truck p11 t2 l2-2)
   deleted: (at p11 l2-2)
   added: (in p11 t2)
   goals met: 1 of 27
6. (load-truck p24 t1 l1-1)
   deleted: (at p24 l1-1)
   added: (in p24 t1)
   goals met: 1 of 27
7. (load-truck p17 t1 l1-1)
   deleted: (at p17 l1-1)
   added: (in p17 t1)
   goals met: 1 of 27
8. (load-truck p12 t1 l1-1)
   deleted: (at p12 l1-1)
   added: (in p12 t1)
   goals met: 1 of 27
9. (load-truck p1 t1 l1-1)
   deleted: (at p1 l1-1)
   added: (in p1 t1)
   goals met: 1 of 27
10. (load-truck p7 t0 l0-1)
   deleted: (at p7 l0-1)
   added: (in p7 t0)
   goals met: 1 of 27
11. (load-truck p16 t0 l0-1)
   deleted: (at p16 l0-1)
   added: (in p16 t0)
   goals met: 1 of 27
12. (load-airplane p9 a0 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a0)
   goals met: 1 of 27
13. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 1 of 27
14. (unload-truck p25 t2 l2-0)
   deleted: (in p25 t2)
   added: (at p25 l2-0)
   goals met: 2 of 27
15. (unload-truck p22 t2 l2-0)
   deleted: (in p22 t2)
   added: (at p22 l2-0)
   goals met: 2 of 27
16. (unload-truck p20 t2 l2-0)
   deleted: (in p20 t2)
   added: (at p20 l2-0)
   goals met: 2 of 27
17. (load-airplane p22 a0 l2-0)
   deleted: (at p22 l2-0)
   added: (in p22 a0)
   goals met: 2 of 27
18. (load-airplane p20 a0 l2-0)
   deleted: (at p20 l2-0)
   added: (in p20 a0)
   goals met: 2 of 27
19. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 2 of 27
20. (unload-truck p11 t2 l2-1)
   deleted: (in p11 t2)
   added: (at p11 l2-1)
   goals met: 3 of 27
21. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 3 of 27
22. (unload-truck p24 t1 l1-0)
   deleted: (in p24 t1)
   added: (at p24 l1-0)
   goals met: 3 of 27
23. (unload-truck p17 t1 l1-0)
   deleted: (in p17 t1)
   added: (at p17 l1-0)
   goals met: 3 of 27
24. (unload-truck p12 t1 l1-0)
   deleted: (in p12 t1)
   added: (at p12 l1-0)
   goals met: 3 of 27
25. (unload-truck p1 t1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 4 of 27
26. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 4 of 27
27. (load-truck p8 t1 l1-2)
   deleted: (at p8 l1-2)
   added: (in p8 t1)
   goals met: 4 of 27
28. (load-truck p5 t1 l1-2)
   deleted: (at p5 l1-2)
   added: (in p5 t1)
   goals met: 4 of 27
29. (load-truck p4 t1 l1-2)
   deleted: (at p4 l1-2)
   added: (in p4 t1)
   goals met: 4 of 27
30. (load-truck p3 t1 l1-2)
   deleted: (at p3 l1-2)
   added: (in p3 t1)
   goals met: 4 of 27
31. (load-truck p21 t1 l1-2)
   deleted: (at p21 l1-2)
   added: (in p21 t1)
   goals met: 4 of 27
32. (load-truck p13 t1 l1-2)
   deleted: (at p13 l1-2)
   added: (in p13 t1)
   goals met: 4 of 27
33. (load-truck p0 t1 l1-2)
   deleted: (at p0 l1-2)
   added: (in p0 t1)
   goals met: 4 of 27
34. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 4 of 27
35. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 4 of 27
36. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 4 of 27
37. (unload-truck p4 t1 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 4 of 27
38. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 4 of 27
39. (unload-truck p21 t1 l1-0)
   deleted: (in p21 t1)
   added: (at p21 l1-0)
   goals met: 4 of 27
40. (unload-truck p13 t1 l1-0)
   deleted: (in p13 t1)
   added: (at p13 l1-0)
   goals met: 4 of 27
41. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 4 of 27
42. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 4 of 27
43. (unload-truck p7 t0 l0-0)
   deleted: (in p7 t0)
   added: (at p7 l0-0)
   goals met: 5 of 27
44. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 5 of 27
45. (load-truck p26 t0 l0-2)
   deleted: (at p26 l0-2)
   added: (in p26 t0)
   goals met: 5 of 27
46. (load-truck p23 t0 l0-2)
   deleted: (at p23 l0-2)
   added: (in p23 t0)
   goals met: 5 of 27
47. (load-truck p15 t0 l0-2)
   deleted: (at p15 l0-2)
   added: (in p15 t0)
   goals met: 5 of 27
48. (load-truck p10 t0 l0-2)
   deleted: (at p10 l0-2)
   added: (in p10 t0)
   goals met: 5 of 27
49. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 5 of 27
50. (unload-truck p23 t0 l0-0)
   deleted: (in p23 t0)
   added: (at p23 l0-0)
   goals met: 5 of 27
51. (load-truck p2 t0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 5 of 27
52. (unload-truck p16 t0 l0-0)
   deleted: (in p16 t0)
   added: (at p16 l0-0)
   goals met: 5 of 27
53. (unload-truck p15 t0 l0-0)
   deleted: (in p15 t0)
   added: (at p15 l0-0)
   goals met: 5 of 27
54. (unload-truck p10 t0 l0-0)
   deleted: (in p10 t0)
   added: (at p10 l0-0)
   goals met: 5 of 27
55. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 5 of 27
56. (unload-truck p26 t0 l0-1)
   deleted: (in p26 t0)
   added: (at p26 l0-1)
   goals met: 6 of 27
57. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 6 of 27
58. (unload-truck p2 t0 l0-2)
   deleted: (in p2 t0)
   added: (at p2 l0-2)
   goals met: 7 of 27
59. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 7 of 27
60. (unload-airplane p9 a0 l0-0)
   deleted: (in p9 a0)
   added: (at p9 l0-0)
   goals met: 7 of 27
61. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 7 of 27
62. (load-airplane p8 a0 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a0)
   goals met: 7 of 27
63. (load-airplane p6 a0 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 a0)
   goals met: 7 of 27
64. (load-airplane p5 a0 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a0)
   goals met: 7 of 27
65. (load-airplane p4 a0 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 7 of 27
66. (load-airplane p3 a0 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a0)
   goals met: 7 of 27
67. (load-airplane p24 a0 l1-0)
   deleted: (at p24 l1-0)
   added: (in p24 a0)
   goals met: 7 of 27
68. (unload-airplane p22 a0 l1-0)
   deleted: (in p22 a0)
   added: (at p22 l1-0)
   goals met: 7 of 27
69. (load-truck p22 t1 l1-0)
   deleted: (at p22 l1-0)
   added: (in p22 t1)
   goals met: 7 of 27
70. (load-airplane p21 a0 l1-0)
   deleted: (at p21 l1-0)
   added: (in p21 a0)
   goals met: 7 of 27
71. (load-airplane p18 a0 l1-0)
   deleted: (at p18 l1-0)
   added: (in p18 a0)
   goals met: 7 of 27
72. (load-airplane p17 a0 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 a0)
   goals met: 7 of 27
73. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 7 of 27
74. (load-airplane p12 a0 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 a0)
   goals met: 7 of 27
75. (load-airplane p0 a0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a0)
   goals met: 7 of 27
76. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 7 of 27
77. (unload-truck p22 t1 l1-2)
   deleted: (in p22 t1)
   added: (at p22 l1-2)
   goals met: 8 of 27
78. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 8 of 27
79. (load-truck p9 t0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 t0)
   goals met: 8 of 27
80. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 8 of 27
81. (unload-truck p9 t0 l0-2)
   deleted: (in p9 t0)
   added: (at p9 l0-2)
   goals met: 9 of 27
82. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 9 of 27
83. (unload-airplane p8 a0 l0-0)
   deleted: (in p8 a0)
   added: (at p8 l0-0)
   goals met: 9 of 27
84. (unload-airplane p5 a0 l0-0)
   deleted: (in p5 a0)
   added: (at p5 l0-0)
   goals met: 9 of 27
85. (unload-airplane p3 a0 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 9 of 27
86. (unload-airplane p24 a0 l0-0)
   deleted: (in p24 a0)
   added: (at p24 l0-0)
   goals met: 9 of 27
87. (load-airplane p23 a0 l0-0)
   deleted: (at p23 l0-0)
   added: (in p23 a0)
   goals met: 9 of 27
88. (unload-airplane p20 a0 l0-0)
   deleted: (in p20 a0)
   added: (at p20 l0-0)
   goals met: 10 of 27
89. (load-airplane p19 a0 l0-0)
   deleted: (at p19 l0-0)
   added: (in p19 a0)
   goals met: 10 of 27
90. (unload-airplane p18 a0 l0-0)
   deleted: (in p18 a0)
   added: (at p18 l0-0)
   goals met: 10 of 27
91. (unload-airplane p17 a0 l0-0)
   deleted: (in p17 a0)
   added: (at p17 l0-0)
   goals met: 10 of 27
92. (load-airplane p16 a0 l0-0)
   deleted: (at p16 l0-0)
   added: (in p16 a0)
   goals met: 10 of 27
93. (load-airplane p15 a0 l0-0)
   deleted: (at p15 l0-0)
   added: (in p15 a0)
   goals met: 10 of 27
94. (unload-airplane p12 a0 l0-0)
   deleted: (in p12 a0)
   added: (at p12 l0-0)
   goals met: 11 of 27
95. (load-airplane p10 a0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a0)
   goals met: 11 of 27
96. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 11 of 27
97. (unload-airplane p23 a0 l1-0)
   deleted: (in p23 a0)
   added: (at p23 l1-0)
   goals met: 11 of 27
98. (unload-airplane p19 a0 l1-0)
   deleted: (in p19 a0)
   added: (at p19 l1-0)
   goals met: 11 of 27
99. (unload-airplane p16 a0 l1-0)
   deleted: (in p16 a0)
   added: (at p16 l1-0)
   goals met: 12 of 27
100. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 12 of 27
101. (unload-airplane p6 a0 l2-0)
   deleted: (in p6 a0)
   added: (at p6 l2-0)
   goals met: 13 of 27
102. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 13 of 27
103. (unload-airplane p21 a0 l2-0)
   deleted: (in p21 a0)
   added: (at p21 l2-0)
   goals met: 14 of 27
104. (unload-airplane p15 a0 l2-0)
   deleted: (in p15 a0)
   added: (at p15 l2-0)
   goals met: 14 of 27
105. (unload-airplane p13 a0 l2-0)
   deleted: (in p13 a0)
   added: (at p13 l2-0)
   goals met: 14 of 27
106. (unload-airplane p10 a0 l2-0)
   deleted: (in p10 a0)
   added: (at p10 l2-0)
   goals met: 15 of 27
107. (unload-airplane p0 a0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 15 of 27
108. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 15 of 27
109. (load-truck p4 t2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 t2)
   goals met: 15 of 27
110. (load-truck p15 t2 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 t2)
   goals met: 15 of 27
111. (load-truck p13 t2 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 t2)
   goals met: 15 of 27
112. (load-truck p0 t2 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 t2)
   goals met: 15 of 27
113. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 15 of 27
114. (unload-truck p4 t2 l2-1)
   deleted: (in p4 t2)
   added: (at p4 l2-1)
   goals met: 16 of 27
115. (unload-truck p0 t2 l2-1)
   deleted: (in p0 t2)
   added: (at p0 l2-1)
   goals met: 17 of 27
116. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 17 of 27
117. (unload-truck p15 t2 l2-2)
   deleted: (in p15 t2)
   added: (at p15 l2-2)
   goals met: 18 of 27
118. (unload-truck p13 t2 l2-2)
   deleted: (in p13 t2)
   added: (at p13 l2-2)
   goals met: 19 of 27
119. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 19 of 27
120. (load-truck p23 t1 l1-0)
   deleted: (at p23 l1-0)
   added: (in p23 t1)
   goals met: 19 of 27
121. (load-truck p19 t1 l1-0)
   deleted: (at p19 l1-0)
   added: (in p19 t1)
   goals met: 19 of 27
122. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 19 of 27
123. (unload-truck p19 t1 l1-1)
   deleted: (in p19 t1)
   added: (at p19 l1-1)
   goals met: 20 of 27
124. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 20 of 27
125. (unload-truck p23 t1 l1-2)
   deleted: (in p23 t1)
   added: (at p23 l1-2)
   goals met: 21 of 27
126. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 21 of 27
127. (load-truck p8 t0 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 t0)
   goals met: 21 of 27
128. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 21 of 27
129. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 21 of 27
130. (load-truck p24 t0 l0-0)
   deleted: (at p24 l0-0)
   added: (in p24 t0)
   goals met: 21 of 27
131. (load-truck p18 t0 l0-0)
   deleted: (at p18 l0-0)
   added: (in p18 t0)
   goals met: 21 of 27
132. (load-truck p17 t0 l0-0)
   deleted: (at p17 l0-0)
   added: (in p17 t0)
   goals met: 21 of 27
133. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 21 of 27
134. (unload-truck p5 t0 l0-1)
   deleted: (in p5 t0)
   added: (at p5 l0-1)
   goals met: 22 of 27
135. (unload-truck p18 t0 l0-1)
   deleted: (in p18 t0)
   added: (at p18 l0-1)
   goals met: 23 of 27
136. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 23 of 27
137. (unload-truck p8 t0 l0-2)
   deleted: (in p8 t0)
   added: (at p8 l0-2)
   goals met: 24 of 27
138. (unload-truck p3 t0 l0-2)
   deleted: (in p3 t0)
   added: (at p3 l0-2)
   goals met: 25 of 27
139. (unload-truck p24 t0 l0-2)
   deleted: (in p24 t0)
   added: (at p24 l0-2)
   goals met: 26 of 27
140. (unload-truck p17 t0 l0-2)
   deleted: (in p17 t0)
   added: (at p17 l0-2)
   goals met: 27 of 27
